class Translation(object):
    START_TEXT = """<b>- مࢪحبـاً بك عـزيـزي 
- فـي بـوت اسـتخـࢪاج كـود الايـبـي ايـدي & الايـبـي هـاش
(APP ID and API Hash)
- 𝗗𝗘𝗩𝗦 : [بـلاك](https://t.me/a_t_9)
━━━━━━━━━━━━━━━━━━━━━━━━
- تـستـطيـع اسـتخـࢪاج الاكـواد بـكل سهـوله
- الان اࢪسـل الـرقـم الـخاص بك مـع مـفـتاح الـدوله
- مثــل :
+964XXXXXXXXXX</b>
"""
    AFTER_RECVD_CODE_TEXT = """<b>- الان قـم باࢪسـال رمـز دخـول الويب
الـذي تـم اࢪسـاله الـيك من شـࢪكـة تـيليـجـࢪام</b>

يـستـخـدم هـذا الࢪمـز فقط للحصول على اكـواد الايبيـات مـن my.telegram.org
"""
    BEFORE_SUCC_LOGIN = "<code>- جـاࢪ اسـتخـࢪاج الاكـواد الࢪجـاء الانـتظـار . . .</code>"
    ERRED_PAGE = """- خـطأ فـي الاسـتخـࢪاج .. جࢪب الطـࢪيقـة اليـدويـة عبـࢪ الرابـط

كيـفـية اسـتخࢪاج كـود الايـبـي ايـدي والايـبـي هـاش عبـࢪ الࢪابـط:
1- اذهـب الـى my.telegram.org/auth
2- قـم بـتسـجيـل الـدخـول إلـى حـسـاب تيـليـجࢪام الـخاص بك عبـࢪ الـرقم
3- اضـغـط عـلى خـيـار API Development
4- امـلأ البـيـانـات عـلى النـحو الـتـالي :
• App Title : tgbot
• Short Name : tgbot
• URL : kosongin
• Platform : desktop
5- تـم الانتـهاء مـن الاسـتخـࢪاج
إذا قمـت باسـتخࢪاج الاكـواد بنـجاح ، تـستـطيع الـمحـاولة مـࢪة أخـࢪى عـلى البـوت فـي اي وقـت"""

    CANCELLED_MESG = "<b>- شكـراً لاستـخدامـك البـوت .. لاعـادة الاسـتخࢪاج مجـدداً اࢪسـل /start</b>"
    IN_VALID_CODE_PVDED = "<b>- خطـأ .. رمـز الـدخـول الـذي أدخلتـه غيـࢪ صـحـيح ؟!</b>"
    IN_VALID_PHNO_PVDED = "<b>- عـذراً .. رقـم الهـاتـف الـخاص بك الـذي أدخلـتـه غيࢪ صـحـيح ، الࢪجـاء إدخـال رقـم حسـاب تيـليـجـࢪام مـع مفـتـاح الـدولة.\n- مثــل : +964XXXXXXXXXX</b>"
